//
// Copyright (c) 2016-2017 Enrico Kaden & University College London
// All rights reserved.
//
// Redistribution and use in source and binary forms, with or without
// modification, are permitted provided that the following conditions are met:
//
// * Redistributions of source code must retain the above copyright notice, this
//   list of conditions and the following disclaimer.
//
// * Redistributions in binary form must reproduce the above copyright notice,
//   this list of conditions and the following disclaimer in the documentation
//   and/or other materials provided with the distribution.
//
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
// AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
// IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
// DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
// FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
// DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
// SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
// CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
// OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
//

#ifndef _NIFTI_H
#define _NIFTI_H

#include <algorithm>
#include <cctype>
#include <complex>
#include <cstdio>
#include <cstdlib>
#include <cstring>
#include <functional>
#include <iostream>
#include <iterator>
#include <limits>
#include <string>
#include <tuple>
#include <utility>

#include <sys/mman.h>
#ifdef ZLIB_FOUND
#include <zlib.h>
#endif // ZLIB_FOUND

#include "nifti1.h"

#include "darray.h"
#include "debug.h"
#include "sarray.h"

namespace smt {

namespace {

static_assert(sizeof(signed char) == 1, "sizeof(signed char) == 1");
static_assert(sizeof(unsigned char) == 1, "sizeof(unsigned char) == 1");
static_assert(sizeof(signed short int) == 2, "sizeof(signed short int) == 2");
static_assert(sizeof(unsigned short int) == 2, "sizeof(unsigned short int) == 2");
static_assert(sizeof(signed int) == 4, "sizeof(signed int) == 4");
static_assert(sizeof(unsigned int) == 4, "sizeof(unsigned int) == 4");
static_assert(sizeof(signed long int) == 8, "sizeof(signed long int) == 8");
static_assert(sizeof(unsigned long int) == 8, "sizeof(unsigned long int) == 8");
static_assert(sizeof(float) == 4, "sizeof(float) == 4");
static_assert(sizeof(double) == 8, "sizeof(double) == 8");
static_assert(sizeof(long double) == 16, "sizeof(float) == 16");
static_assert(sizeof(std::complex<float>) == 8, "sizeof(std::complex<float>) == 8");
static_assert(sizeof(std::complex<double>) == 16, "sizeof(std::complex<double>) == 16");
static_assert(sizeof(std::complex<long double>) == 32, "sizeof(std::complex<float>) == 32");

std::size_t nifti_bytesize(const short& datatype) {
	switch(datatype) {
	case NIFTI_TYPE_INT8:
		return sizeof(signed char);
	case NIFTI_TYPE_UINT8:
		return sizeof(unsigned char);
	case NIFTI_TYPE_INT16:
		return sizeof(signed short int);
	case NIFTI_TYPE_UINT16:
		return sizeof(unsigned short int);
	case NIFTI_TYPE_INT32:
		return sizeof(signed int);
	case NIFTI_TYPE_UINT32:
		return sizeof(unsigned int);
	case NIFTI_TYPE_INT64:
		return sizeof(signed long int);
	case NIFTI_TYPE_UINT64:
		return sizeof(unsigned long int);
	case NIFTI_TYPE_FLOAT32:
		return sizeof(float);
	case NIFTI_TYPE_FLOAT64:
		return sizeof(double);
	case NIFTI_TYPE_FLOAT128:
		return sizeof(long double);
	case NIFTI_TYPE_COMPLEX64:
		return sizeof(std::complex<float>);
	case NIFTI_TYPE_COMPLEX128:
		return sizeof(std::complex<double>);
	case NIFTI_TYPE_COMPLEX256:
		return sizeof(std::complex<long double>);
	default:
